src/СРМ/src/InformationRegisters/ПредметыПапкиВзаимодействий/ПредметыПапкиВзаимодействий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПредметыПапкиВзаимодействий</name>
  <resources>
    <name>Предмет</name>
    <type>
      <types>DefinedType.ПредметВзаимодействия</types>
    </type>
  </resources>
  <resources>
    <name>ПапкаЭлектронногоПисьма</name>
    <type>
      <types>CatalogRef.ПапкиЭлектронныхПисем</types>
    </type>
  </resources>
  <resources>
    <name>Рассмотрено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РассмотретьПосле</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Взаимодействие</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЗапланированноеВзаимодействие</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.Встреча</types>
      <types>DocumentRef.СообщениеSMS</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/СРМ/src/Enums/ТипыТекстовЭлектронныхПисем/ТипыТекстовЭлектронныхПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыТекстовЭлектронныхПисем</name>
  <enumValues>
    <name>HTML</name>
  </enumValues>
  <enumValues>
    <name>ПростойТекст</name>
  </enumValues>
  <enumValues>
    <name>РазмеченныйТекст</name>
  </enumValues>
  <enumValues>
    <name>HTMLСКартинками</name>
  </enumValues>
</mdclass:Enum>

src/СРМ/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
</mdclass:Enum>

src/СРМ/src/Enums/ФорматыТекстаКомментариев/ФорматыТекстаКомментариев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматыТекстаКомментариев</name>
  <enumValues>
    <name>HTML</name>
  </enumValues>
  <enumValues>
    <name>Markdown</name>
  </enumValues>
</mdclass:Enum>

src/СРМ/src/Documents/ЭлектронноеПисьмоВходящее/ЭлектронноеПисьмоВходящее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлектронноеПисьмоВходящее</name>
  <posting>Deny</posting>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийЗаголовок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторыОснований</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительКонтакт</name>
    <type>
      <types>DefinedType.КонтактВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейКопий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>EnumRef.ТипыТекстовЭлектронныхПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВзаимодействиеОснование</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОДоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОПрочтении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХэшСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиПисьма</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиОтвета</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АдресаУведомленияОПрочтении</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НепринятыеВложения</name>
    <attributes>
      <name>ИмяВложение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/СРМ/src/Documents/Задача/Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Задача</name>
  <basedOn>Document.Задача</basedOn>
  <registerRecords>AccumulationRegister.Трудозатраты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботПоЗадаче</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактОбращения</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаТрудозатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаТрудозатратИсполнителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Редактор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскаяЗадача</name>
    <type>
      <types>DocumentRef.Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Спринт</name>
    <type>
      <types>DocumentRef.Спринт</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияАвто</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Срочность</name>
    <type>
      <types>CatalogRef.СрочностиЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>CatalogRef.ВидыОплатыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеФормат</name>
    <type>
      <types>EnumRef.ФорматыТекстаКомментариев</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЗакрытия</name>
    <type>
      <types>CatalogRef.КатегорииЗакрытияЗадач</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОтправки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/СРМ/src/CommonModules/АвтоматическаяПостановкаЗадачСервер/Module.bsl
Функция СоответствиеНастроекАвтоформирования() Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	НастройкиАвтоматическогоФормированияЗадач.Ссылка КАК Ссылка,
	|	НастройкиАвтоматическогоФормированияЗадач.УчетнаяЗаписьЭлектроннойПочты КАК УчетнаяЗаписьЭлектроннойПочты
	|ИЗ
	|	Справочник.НастройкиАвтоматическогоФормированияЗадач КАК НастройкиАвтоматическогоФормированияЗадач
	|ГДЕ
	|	НастройкиАвтоматическогоФормированияЗадач.Использование";
	Выборка=Запрос.Выполнить().Выбрать();

	СоответствиеФормирования=Новый Соответствие;

	Пока Выборка.Следующий() Цикл
		СоответствиеФормирования.Вставить(Выборка.УчетнаяЗаписьЭлектроннойПочты, Выборка.Ссылка);
	КонецЦикла;

	Возврат СоответствиеФормирования;
КонецФункции

Процедура АвтоматическаяПоставновкаЗадач() Экспорт

	СоответствиеНастроек=СоответствиеНастроекАвтоформирования();

	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ЭлектронноеПисьмоВходящее.Ссылка КАК Ссылка,
	|	ЭлектронноеПисьмоВходящее.УчетнаяЗапись КАК УчетнаяЗапись,
	|	ПредметыПапкиВзаимодействий.Предмет КАК Предмет,
	|	ПредметыПапкиВзаимодействий.ПапкаЭлектронногоПисьма КАК ПапкаЭлектронногоПисьма,
	|	ПредметыПапкиВзаимодействий.Рассмотрено КАК Рассмотрено,
	|	ПредметыПапкиВзаимодействий.РассмотретьПосле КАК РассмотретьПосле
	|ИЗ
	|	Документ.ЭлектронноеПисьмоВходящее КАК ЭлектронноеПисьмоВходящее
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредметыПапкиВзаимодействий КАК ПредметыПапкиВзаимодействий
	|		ПО ЭлектронноеПисьмоВходящее.Ссылка = ПредметыПапкиВзаимодействий.Взаимодействие
	|ГДЕ
	|	ПредметыПапкиВзаимодействий.Рассмотрено = ЛОЖЬ";
	Выборка=Запрос.Выполнить().Выбрать();

	МассивПисемДляОбработки=Новый Массив;

	СоответствиеПисемИПапок=Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		НастройкаАвтоформирования=СоответствиеНастроек[Выборка.УчетнаяЗапись];

		Если НастройкаАвтоформирования.ПапкаЭлектроннойПочтыДляПоискаПисем <> Выборка.ПапкаЭлектронногоПисьма
			И ЗначениеЗаполнено(Выборка.ПапкаЭлектронногоПисьма) Тогда
			Продолжить;
		КонецЕсли;

		Попытка
			ОбработатьПисьмоЭлектроннойПочты(Выборка.Ссылка, НастройкаАвтоформирования);
			Папка=НастройкаАвтоформирования.ПапкаЭлектроннойПочтыДляУспешноОбработанныхПисем;
		Исключение
			Папка=НастройкаАвтоформирования.ПапкаЭлектроннойПочтыДляОшибочноОбработанныхПисем;
			
			Ошибка=ОписаниеОшибки();
			Сообщить(Ошибка);
			ЗаписьЖурналаРегистрации("Задачи.РаботаЧерезПочту", УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Документы.ЭлектронноеПисьмоВходящее, Выборка.Ссылка, Ошибка);
		КонецПопытки;

		Если СоответствиеПисемИПапок[Папка] = Неопределено Тогда
			СоответствиеПисемИПапок.Вставить(Папка, Новый Массив);
		КонецЕсли;

		СоответствиеПисемИПапок[Папка].Добавить(Выборка.Ссылка);
		МассивПисемДляОбработки.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	
	//Теперь нужно установить признак рассмотрено для этого письма
	Взаимодействия.УстановитьПризнакРассмотрено(МассивПисемДляОбработки, Истина, Истина);

	//Теперь переложим все хозяйство по папкам
	Для Каждого КлючЗначение Из СоответствиеПисемИПапок Цикл
		Взаимодействия.УстановитьПапкуДляМассиваПисем(КлючЗначение.Значение, КлючЗначение.Ключ);
	КонецЦикла;
КонецПроцедуры

Функция НайтиСуществующуюЗадачу(ТемаПисьма) Экспорт
	КомпонентаРегВыражения=РегулярныеВыраженияКлиентСервер.КомпонентаРегулярныхВыражений(Ложь, Истина, "", Ложь);

	РезультатПоиска=РегулярныеВыраженияКлиентСервер.НайтиСовпадения(ТемаПисьма, "\[*#([\d]+)*\]*",
		КомпонентаРегВыражения);

	Если РезультатПоиска = Неопределено Тогда
		Возврат Документы.Задача.ПустаяСсылка();
	КонецЕсли;

	Если РезультатПоиска.Количество() = 0 Тогда
		Возврат Документы.Задача.ПустаяСсылка();
	КонецЕсли;

	НомерЗадачиПолный=РезультатПоиска[0];
	НомерЗадачиПолный=СтрЗаменить(НомерЗадачиПолный, "#", "");
	НомерЗадачиПолный=СтрЗаменить(НомерЗадачиПолный, "[", "");
	НомерЗадачиПолный=СтрЗаменить(НомерЗадачиПолный, "]", "");

	Попытка
		НомерЗадачиПолный=Число(НомерЗадачиПолный);
	Исключение
		НомерЗадачиПолный=Неопределено;
	КонецПопытки;

	Если НомерЗадачиПолный = Неопределено Тогда
		Возврат Документы.Задача.ПустаяСсылка();
	КонецЕсли;

	Если Не ЗначениеЗаполнено(НомерЗадачиПолный) Тогда
		Возврат Документы.Задача.ПустаяСсылка();
	КонецЕсли;

	Возврат Документы.Задача.НайтиПоНомеру(НомерЗадачиПолный);
КонецФункции

Функция АвторСобытияПоПисьмуЭлектроннойПочты(СообщениеЭлектроннойПочты, НастройкаАвтоматическогоФормированияЗадач)

	Если ТипЗнч(СообщениеЭлектроннойПочты.ОтправительКонтакт) = Тип("СправочникСсылка.Пользователи") Тогда
		Автор=СообщениеЭлектроннойПочты.ОтправительКонтакт;
	ИначеЕсли ЗначениеЗаполнено(НастройкаАвтоматическогоФормированияЗадач.АвторПоУмолчанию) Тогда
		Автор=НастройкаАвтоматическогоФормированияЗадач.АвторПоУмолчанию;
	Иначе
		Автор=Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;

	Возврат Автор;

КонецФункции

Функция ТекстСообщенияHTMLЭлектроннойПочтыДляЗадачи(СообщениеЭлектроннойПочты, НастройкаАвтоматическогоФормированияЗадач)
	Если СообщениеЭлектроннойПочты.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML
		Или СообщениеЭлектроннойПочты.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTMLСКартинками Тогда
		Возврат СообщениеЭлектроннойПочты.ТекстHTML;
	Иначе
		Возврат СообщениеЭлектроннойПочты.Текст;
	КонецЕсли;
КонецФункции

Функция КонтактПоЭдресуИПредставлениюПолучателя(АдресЭлектроннойПочты, ПредставлениеКонтакта)

	КонтактыПоМылу=ФизическиеЛицаСервер.КонтактыПоEmail(АдресЭлектроннойПочты);

	Если КонтактыПоМылу.Количество() > 0 Тогда
		Возврат КонтактыПоМылу[0].Контакт;
	КонецЕсли;
	
	//Создаем контакт как новое физическое лицо
	НовыйКонтакт=Справочники.ФизическиеЛица.СоздатьЭлемент();

	ИмяКонтакта=ПредставлениеКонтакта;
	НомерСимвола=СтрНайти(ИмяКонтакта, "<");
	Если ЗначениеЗаполнено(НомерСимвола) Тогда
		ИмяКонтакта=СокрЛП(Лев(ИмяКонтакта, НомерСимвола - 1));
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ИмяКонтакта) Тогда
		ИмяКонтакта=АдресЭлектроннойПочты;
	КонецЕсли;
	НовыйКонтакт.Наименование=ИмяКонтакта;

	НоваяКИ=НовыйКонтакт.КонтактнаяИнформация.Добавить();
	НоваяКИ.Вид=Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица;
	НоваяКИ.Тип=Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	//НоваяКИ.Значение=СообщениеЭлектроннойПочты.ОтправительАдрес;
	НоваяКИ.Представление=АдресЭлектроннойПочты;
	НоваяКИ.АдресЭП=АдресЭлектроннойПочты;
	НовыйКонтакт.Записать();

	Возврат НовыйКонтакт.Ссылка;

КонецФункции

Функция КонтактСообщенияЭлектроннойПочты(СообщениеЭлектроннойПочты, НастройкаАвтоматическогоФормированияЗадач)
	Если ЗначениеЗаполнено(СообщениеЭлектроннойПочты.ОтправительКонтакт) И ТипЗнч(
		СообщениеЭлектроннойПочты.ОтправительКонтакт) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Возврат СообщениеЭлектроннойПочты.ОтправительКонтакт;
	КонецЕсли;

	Возврат КонтактПоЭдресуИПредставлениюПолучателя(СообщениеЭлектроннойПочты.ОтправительАдрес,
		СообщениеЭлектроннойПочты.ОтправительПредставление);
КонецФункции

Процедура ЗаполнитьКопииПолучателейВСобытииЗадачиПоЭлектронномуПисьму(СобытиеОбъект, СообщениеЭлектроннойПочты,
	НастройкаАвтоматическогоФормированияЗадач)
	МассивАдресов=Новый Массив;
	МассивАдресов.Добавить(НРег(СообщениеЭлектроннойПочты.УчетнаяЗапись.АдресЭлектроннойПочты));

	Если ТипЗнч(СобытиеОбъект)=Тип("ДокументОбъект.Задача") Тогда
		ТаблицаДопПолучателей=СобытиеОбъект.ПолучателиКопий;
	Иначе
		ТаблицаДопПолучателей=СобытиеОбъект.ДополнительныеПолучателиОповещения;
	КонецЕсли;

	Для Каждого СтрокаПолучателя Из СообщениеЭлектроннойПочты.ПолучателиПисьма Цикл
		Если МассивАдресов.Найти(НРег(СтрокаПолучателя.Адрес)) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Если НРег(СообщениеЭлектроннойПочты.УчетнаяЗапись.АдресЭлектроннойПочты) = СтрокаПолучателя.Адрес Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока=ТаблицаДопПолучателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПолучателя);

		НоваяСтрока.Контакт=КонтактПоЭдресуИПредставлениюПолучателя(СтрокаПолучателя.Адрес,
			СтрокаПолучателя.Представление);
		НоваяСтрока.Представление=ВзаимодействияКлиентСервер.ПолучитьПредставлениеАдресата(НоваяСтрока.Представление,
			НоваяСтрока.Адрес, "");

		МассивАдресов.Добавить(НРег(СтрокаПолучателя.Адрес));
	КонецЦикла;
	Для Каждого СтрокаПолучателя Из СообщениеЭлектроннойПочты.ПолучателиКопий Цикл
		Если МассивАдресов.Найти(НРег(СтрокаПолучателя.Адрес)) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если НРег(СообщениеЭлектроннойПочты.УчетнаяЗапись.АдресЭлектроннойПочты) = СтрокаПолучателя.Адрес Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока=ТаблицаДопПолучателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПолучателя);

		НоваяСтрока.Контакт=КонтактПоЭдресуИПредставлениюПолучателя(СтрокаПолучателя.Адрес,
			СтрокаПолучателя.Представление);
		НоваяСтрока.Представление=ВзаимодействияКлиентСервер.ПолучитьПредставлениеАдресата(НоваяСтрока.Представление,
			НоваяСтрока.Адрес, "");

		МассивАдресов.Добавить(НРег(СтрокаПолучателя.Адрес));
	КонецЦикла;
	Для Каждого СтрокаПолучателя Из СообщениеЭлектроннойПочты.ПолучателиОтвета Цикл
		Если МассивАдресов.Найти(НРег(СтрокаПолучателя.Адрес)) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если НРег(СообщениеЭлектроннойПочты.УчетнаяЗапись.АдресЭлектроннойПочты) = СтрокаПолучателя.Адрес Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока=ТаблицаДопПолучателей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПолучателя);

		НоваяСтрока.Контакт=КонтактПоЭдресуИПредставлениюПолучателя(СтрокаПолучателя.Адрес,
			СтрокаПолучателя.Представление);
		НоваяСтрока.Представление=ВзаимодействияКлиентСервер.ПолучитьПредставлениеАдресата(НоваяСтрока.Представление,
			НоваяСтрока.Адрес, "");

		МассивАдресов.Добавить(НРег(СтрокаПолучателя.Адрес));
	КонецЦикла;
КонецПроцедуры

Процедура СкопироватьФайлыИзЭлектронногоПисьмаВСобытиеПоЗадаче(Событие, СообщениеЭлектроннойПочты,
	НастройкаАвтоматическогоФормированияЗадач)
	//Копируем файлы 
	//засовываем в присоединенные файлы вложения письма
	МассивПрисоединенныхФайлов=Новый Массив;
	РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(СообщениеЭлектроннойПочты, МассивПрисоединенныхФайлов);

	Если ТипЗнч(МассивПрисоединенныхФайлов) = Тип("Массив") Тогда
		Для Каждого ТекВложение Из МассивПрисоединенныхФайлов Цикл
			ДанныеВложения=РаботаСФайлами.ДанныеФайла(ТекВложение);

			ПараметрыФайла=Новый Структура;
			ПараметрыФайла.Вставить("Автор", Событие.Автор);
			Если ТипЗнч(Событие) = Тип("ДокументОбъект.Задача") Тогда
				ПараметрыФайла.Вставить("ВладелецФайлов", Событие.Ссылка);
				ТекстHTML=Событие.Содержание;
			Иначе
				ПараметрыФайла.Вставить("ВладелецФайлов", Событие.Задача);
				ТекстHTML=Событие.ТекстСообщения;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекВложение.ИДФайлаЭлектронногоПисьма) И СтрНайти(ТекстHTML,
				ТекВложение.ИДФайлаЭлектронногоПисьма) Тогда
				ПараметрыФайла.Вставить("ИмяБезРасширения", ТекВложение.ИДФайлаЭлектронногоПисьма);
			Иначе
				ПараметрыФайла.Вставить("ИмяБезРасширения", ДанныеВложения.Наименование);
			КонецЕсли;
			ПараметрыФайла.Вставить("РасширениеБезТочки", ДанныеВложения.Расширение);
			ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", ДанныеВложения.ДатаМодификацииУниверсальная);
			ПараметрыФайла.Вставить("РасширениеБезТочки", ДанныеВложения.Расширение);
			ПараметрыФайла.Вставить("ГруппаФайлов", Неопределено);
			ПараметрыФайла.Вставить("Служебный", Ложь);

			ВложениеСсылка=РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, ДанныеВложения.СсылкаНаДвоичныеДанныеФайла);

			УправлениеЗадачами.УстановитьПредметПрисоединенногоФайла(ВложениеСсылка, Событие);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьНовуюЗадачуПоСообщениюЭлектроннойПочты(СообщениеЭлектроннойПочты,
	НастройкаАвтоматическогоФормированияЗадач)
	НоваяЗадача=Документы.Задача.СоздатьДокумент();
	НоваяЗадача.Дата=ТекущаяДата();

	Если ЗначениеЗаполнено(СообщениеЭлектроннойПочты.Тема) Тогда
		НоваяЗадача.Тема=СообщениеЭлектроннойПочты.Тема;
	Иначе
		НоваяЗадача.Тема="Без темы";
	КонецЕсли;

	НоваяЗадача.КонтактОбращения=КонтактСообщенияЭлектроннойПочты(СообщениеЭлектроннойПочты,
		НастройкаАвтоматическогоФормированияЗадач);
	НоваяЗадача.Автор=АвторСобытияПоПисьмуЭлектроннойПочты(СообщениеЭлектроннойПочты,
		НастройкаАвтоматическогоФормированияЗадач);

	НоваяЗадача.Статус=УправлениеЗадачамиПовтИсп.СтатусЗадачиНовый();
	НоваяЗадача.Проект=НастройкаАвтоматическогоФормированияЗадач.Проект;
	НоваяЗадача.Основание= СообщениеЭлектроннойПочты;

	НоваяЗадача.Содержание=ТекстСообщенияHTMLЭлектроннойПочтыДляЗадачи(СообщениеЭлектроннойПочты,
		НастройкаАвтоматическогоФормированияЗадач);
	НоваяЗадача.СодержаниеФормат=Перечисления.ФорматыТекстаКомментариев.HTML;

	ЗаполнитьКопииПолучателейВСобытииЗадачиПоЭлектронномуПисьму(НоваяЗадача, СообщениеЭлектроннойПочты,
		НастройкаАвтоматическогоФормированияЗадач);
	НоваяЗадача.ДополнительныеСвойства.Вставить("ЭтоИзменениеИзВнешнихИсточников", Истина);
	НоваяЗадача.Записать(РежимЗаписиДокумента.Проведение);

	СкопироватьФайлыИзЭлектронногоПисьмаВСобытиеПоЗадаче(НоваяЗадача, СообщениеЭлектроннойПочты,
		НастройкаАвтоматическогоФормированияЗадач);
КонецПроцедуры

Процедура ДобавитьКомментарийКЗадачеПоСообщениюЭлектроннойПочты(ТекущаяЗадача, СообщениеЭлектроннойПочты,
	НастройкаАвтоматическогоФормированияЗадач)
	НовыйКомментарий=Справочники.КомментарииЗадач.СоздатьЭлемент();
	НовыйКомментарий.Задача=ТекущаяЗадача;
	НовыйКомментарий.Автор=АвторСобытияПоПисьмуЭлектроннойПочты(СообщениеЭлектроннойПочты,
		НастройкаАвтоматическогоФормированияЗадач);
	НовыйКомментарий.ТекстСообщения=ТекстСообщенияHTMLЭлектроннойПочтыДляЗадачи(СообщениеЭлектроннойПочты,
		НастройкаАвтоматическогоФормированияЗадач);
	НовыйКомментарий.ТекстСообщенияФормат=Перечисления.ФорматыТекстаКомментариев.HTML;
	НовыйКомментарий.Основание=СообщениеЭлектроннойПочты;
//	НовыйКомментарий.Контакт=КонтактСообщенияЭлектроннойПочты(СообщениеЭлектроннойПочты,НастройкаАвтоматическогоФормированияЗадач);

	ЗаполнитьКопииПолучателейВСобытииЗадачиПоЭлектронномуПисьму(НовыйКомментарий, СообщениеЭлектроннойПочты,
		НастройкаАвтоматическогоФормированияЗадач);
	
	НовыйКомментарий.ДополнительныеСвойства.Вставить("ЭтоИзменениеИзВнешнихИсточников", Истина);

	НовыйКомментарий.Записать();

	СкопироватьФайлыИзЭлектронногоПисьмаВСобытиеПоЗадаче(НовыйКомментарий, СообщениеЭлектроннойПочты,
		НастройкаАвтоматическогоФормированияЗадач);
КонецПроцедуры

Процедура ОбработатьПисьмоЭлектроннойПочты(СообщениеЭлектроннойПочты, НастройкаАвтоматическогоФормированияЗадач)
	ТекущаяЗадача=НайтиСуществующуюЗадачу(СообщениеЭлектроннойПочты.Тема);

	Если ЗначениеЗаполнено(ТекущаяЗадача) Тогда
		ДобавитьКомментарийКЗадачеПоСообщениюЭлектроннойПочты(ТекущаяЗадача, СообщениеЭлектроннойПочты,
			НастройкаАвтоматическогоФормированияЗадач);
	Иначе
		СоздатьНовуюЗадачуПоСообщениюЭлектроннойПочты(СообщениеЭлектроннойПочты,
			НастройкаАвтоматическогоФормированияЗадач);
	КонецЕсли;

КонецПроцедуры
